Challenge 2 - Create the Database and Tables¶
1) Create a MySQL database for this lab.

In [1]:
%reload_ext sql

In [2]:
%sql sqlite:///lab_sqlite.db

In [3]:
%%sql
CREATE TABLE Invoices(id CHAR(20), invoice_number VARCHAR(20), datetime DATETIME, car CHAR(10), custumer CHAR(10),sales_person CHAR(10));

 * sqlite:///lab_sqlite.db
Done.

[]

In [4]:
%%sql 

SELECT * from Invoices;

 * sqlite:///lab_sqlite.db
Done.

[]

4) Then following the USE statement, write all your CREATE TABLE statements. You'll need one CREATE TABLE statement for each table you decide to create. Make sure to end each statement with a semicolon.

In [10]:
%%sql

CREATE TABLE Cars(id CHAR(40) PRIMARY KEY, vin CHAR(20), manufacturer VARCHAR(40), model VARCHAR(40), year VARCHAR(40),color VARCHAR(40));

 * sqlite:///lab_sqlite.db
Done.

[]

In [11]:
%%sql 

SELECT * from Cars;

 * sqlite:///lab_sqlite.db
Done.

[]

In [12]:
%%sql 

DROP TABLE Invoices;

 * sqlite:///lab_sqlite.db
Done.

[]

In [13]:
%%sql

CREATE TABLE Invoices(id CHAR(20) PRIMARY KEY, invoice_number varchar(40), date DATETIME, custumer CHAR(20), sales_person CHAR(20), car CHAR(20));

 * sqlite:///lab_sqlite.db
Done.

[]

In [14]:
%%sql

CREATE TABLE Customer(id CHAR(20) PRIMARY KEY, name VARCHAR(40), phone VARCHAR(40), email VARCHAR(40), adDress VARCHAR(20), city VARCHAR(40),state_providence varchar(60) , country VARCHAR(40),zip_postal VARCHAR(40));

 * sqlite:///lab_sqlite.db
Done.

[]

In [16]:
%%sql

CREATE TABLE Sales_person(id CHAR(20) PRIMARY KEY, name VARCHAR(40), store VARCHAR(40));

 * sqlite:///lab_sqlite.db
Done.

[]

In [32]:
%%sql
CREATE TABLE Customer(id CHAR(20) PRIMARY KEY,customer_id VARCHAR (40), name VARCHAR(40), phone VARCHAR(40), email VARCHAR(40), address VARCHAR(20), city VARCHAR(40),state_providence VARCHAR(60) , country VARCHAR(40),zip_postal VARCHAR(40));

 * sqlite:///lab_sqlite.db
Done.

[]

Challenge 3 - Seeding the Database

The purpose of database seeding is to provide some dummy data for an empty database so that software development can be started based on the dummy data. In this challenge you will create seeding.sql which inserts dummy data rows into the tables of your new database.

You'll be using the INSERT INTO statement for this purpose. A tutorial you can refer to can be fine here.

For your convenience, we provide you some example dummy data. These dummy data may not readily work with your database depending on how you have designed your database. You may need to change them to the appropriate form.

In [25]:
%%sql 

INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (0,'3K096I98581DHSNUP','Volkswagen','Tiguan',2019,'Blue');
INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (1,'ZM8G7BEUQZ97IH46V','Peugeot','Rifter',2019,'Red');
INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (2,'RKXVNNIHLVVZOUB4M','Ford','Fusion',2018,'White');
INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (3,'HKNDGS7CU31E9Z7JW','Toyota','R4V4',2018,'Silver');
INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (4,'DAM41UDN3CHU2WVF6','Volvo','V60',2019,'Gray');
INSERT INTO Cars (id,vin,manufacturer,model,year,color) VALUES (5,'DAM41UDN3CHU2WVF6','Volvo','V60 Cross Country',2019,'Gray');

 * sqlite:///lab_sqlite.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [50]:
%%sql

SELECT * FROM Cars

 * sqlite:///lab_sqlite.db
Done.

[('0', '3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', '2019', 'Blue'),
 ('1', 'ZM8G7BEUQZ97IH46V', 'Peugeot', 'Rifter', '2019', 'Red'),
 ('2', 'RKXVNNIHLVVZOUB4M', 'Ford', 'Fusion', '2018', 'White'),
 ('3', 'HKNDGS7CU31E9Z7JW', 'Toyota', 'R4V4', '2018', 'Silver'),
 ('4', 'DAM41UDN3CHU2WVF6', 'Volvo', 'V60', '2019', 'Gray'),
 ('5', 'DAM41UDN3CHU2WVF6', 'Volvo', 'V60 Cross Country', '2019', 'Gray')]

In [34]:
%%sql 

INSERT INTO Customer(id,customer_id,name,phone,email,address,city,state_providence,country,zip_postal) VALUES (0,10001,'Pablo Picasso','+34 636 17 63 82','-','Paseo de la Chopera, 14','Madrid','Madrid','Spain','28045');
INSERT INTO Customer(id,customer_id,name,phone,email,address,city,state_providence,country,zip_postal) VALUES (1,20001,'Abraham Lincoln','+1 305 907 7086','-','120 SW 8th St','Miami','Florida','United States','33130');
INSERT INTO Customer(id,customer_id,name,phone,email,address,city,state_providence,country,zip_postal) VALUES (2,30001,'Napoléon Bonaparte','+33 1 79 75 40 00','-','40 Rue du Colisée','Paris','Île-de-France','France','75008');

 * sqlite:///lab_sqlite.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [49]:
%%sql

SELECT * FROM Customer

 * sqlite:///lab_sqlite.db
Done.

[('0', '10001', 'Pablo Picasso', '+34 636 17 63 82', '-', 'Paseo de la Chopera, 14', 'Madrid', 'Madrid', 'Spain', '28045'),
 ('1', '20001', 'Abraham Lincoln', '+1 305 907 7086', '-', '120 SW 8th St', 'Miami', 'Florida', 'United States', '33130'),
 ('2', '30001', 'Napoléon Bonaparte', '+33 1 79 75 40 00', '-', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', '75008')]

In [36]:
%%sql

CREATE TABLE SalespersonS(id CHAR(20) PRIMARY KEY,staff_id VARCHAR(40), name VARCHAR(40), store VARCHAR(40));

 * sqlite:///lab_sqlite.db
Done.

[]

In [37]:
%%sql

INSERT INTO Salespersons(id,staff_id,name,store) VALUES(0,00001,'Petey Cruiser','Madrid');

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [38]:
%%sql

INSERT INTO Salespersons(id,staff_id,name,store) VALUES(1,00002,'Anna Sthesia','Barcelona');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(2,00003,'Paul Molive','Berlin');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(3,00004,'Gail Forcewind','Paris');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(4,00005,'Paige Turner','Mimia');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(5,00006,'Bob Frapples','Mexico City');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(6,00007,'Walter Melon','Amsterdam');
INSERT INTO Salespersons(id,staff_id,name,store) VALUES(7,00008,'Shonda Leer','São Paulo');

 * sqlite:///lab_sqlite.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [66]:
%%sql

SELECT * FROM Salespersons

 * sqlite:///lab_sqlite.db
Done.

[('0', '1', 'Petey Cruiser', 'Madrid'),
 ('1', '2', 'Anna Sthesia', 'Barcelona'),
 ('2', '3', 'Paul Molive', 'Berlin'),
 ('3', '4', 'Gail Forcewind', 'Paris'),
 ('4', '5', 'Paige Turner', 'Miami'),
 ('5', '6', 'Bob Frapples', 'Mexico City'),
 ('6', '7', 'Walter Melon', 'Amsterdam'),
 ('7', '8', 'Shonda Leer', 'São Paulo')]

In [42]:
%%sql

CREATE TABLE Invoices(id_ CHAR(20) PRIMARY KEY, invoice_number VARCHAR(40), date DATETIME, car VARCHAR(40),customer VARCHAR(40), sales_person CHAR(20));

 * sqlite:///lab_sqlite.db
Done.

[]

In [44]:
%%sql
INSERT INTO Invoices(id_,invoice_number,date,car,customer,sales_person)VALUES(0,852399038,22-08-2018,0,1,3);
INSERT INTO Invoices(id_,invoice_number,date,car,customer,sales_person)VALUES(1,731166526,31-12-2018,3,0,5);
INSERT INTO Invoices(id_,invoice_number,date,car,customer,sales_person)VALUES(2,271135104,22-01-2019,2,2,7);

 * sqlite:///lab_sqlite.db
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [46]:
%%sql

SELECT * FROM Invoices

 * sqlite:///lab_sqlite.db
Done.

[('0', '852399038', -2004, '0', '1', '3'),
 ('1', '731166526', -1999, '3', '0', '5'),
 ('2', '271135104', -1998, '2', '2', '7')]

Bonus Challenge - Updating and Deleting Database Records

Now you find an error you need to fix in your existing data - in the Salespersons table, you mistakenly spelled Miami as Mimia for Paige Turner. Also, you received the email addresses of the three customers:

In [51]:
%%sql

SELECT * FROM Salespersons;

 * sqlite:///lab_sqlite.db
Done.

[('0', '1', 'Petey Cruiser', 'Madrid'),
 ('1', '2', 'Anna Sthesia', 'Barcelona'),
 ('2', '3', 'Paul Molive', 'Berlin'),
 ('3', '4', 'Gail Forcewind', 'Paris'),
 ('4', '5', 'Paige Turner', 'Mimia'),
 ('5', '6', 'Bob Frapples', 'Mexico City'),
 ('6', '7', 'Walter Melon', 'Amsterdam'),
 ('7', '8', 'Shonda Leer', 'São Paulo')]

In [52]:
%%sql

UPDATE Salespersons
SET store='Miami'
WHERE staff_id= 5

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [54]:
%%sql 
SELECT * FROM Customer;

 * sqlite:///lab_sqlite.db
Done.

[('0', '10001', 'Pablo Picasso', '+34 636 17 63 82', '-', 'Paseo de la Chopera, 14', 'Madrid', 'Madrid', 'Spain', '28045'),
 ('1', '20001', 'Abraham Lincoln', '+1 305 907 7086', '-', '120 SW 8th St', 'Miami', 'Florida', 'United States', '33130'),
 ('2', '30001', 'Napoléon Bonaparte', '+33 1 79 75 40 00', '-', '40 Rue du Colisée', 'Paris', 'Île-de-France', 'France', '75008')]

In [57]:
%%sql
UPDATE Customer
SET email='ppicasso@gmail.com'
WHERE customer_id= 10001;

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [59]:
%%sql
UPDATE Customer
SET email='lincoln@us.gov'
WHERE customer_id= 20001;

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [60]:
%%sql
UPDATE Customer
SET email='hello@napoleon.me'
WHERE customer_id= 30001;

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [64]:
%%sql
DELETE FROM Cars
WHERE id= 4;

 * sqlite:///lab_sqlite.db
1 rows affected.

[]

In [65]:
%%sql

SELECT * FROM CARS

 * sqlite:///lab_sqlite.db
Done.

[('0', '3K096I98581DHSNUP', 'Volkswagen', 'Tiguan', '2019', 'Blue'),
 ('1', 'ZM8G7BEUQZ97IH46V', 'Peugeot', 'Rifter', '2019', 'Red'),
 ('2', 'RKXVNNIHLVVZOUB4M', 'Ford', 'Fusion', '2018', 'White'),
 ('3', 'HKNDGS7CU31E9Z7JW', 'Toyota', 'R4V4', '2018', 'Silver'),
 ('5', 'DAM41UDN3CHU2WVF6', 'Volvo', 'V60 Cross Country', '2019', 'Gray')]